apache/nuttx/arch/arm/src/rtl8720c/8710c/fwlib/include/rtl8710c_i2c_type.h
/**************************************************************************//**
 * @file      rtl8710c_i2c_type.h
 * @brief
 * @version   V1.00
 * @date      2018-1-4 15:41:32
 *
 * @note
 *
 ******************************************************************************
 *
 * Copyright(c) 2007 - 2017 Realtek Corporation. All rights reserved.
 * 
 * SPDX-License-Identifier: Apache-2.0
 * 
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 * 
 * http://www.apache.org/licenses/LICENSE-2.0
 * 
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 * 
 ******************************************************************************/

#ifndef _RTL8710C_I2C_TYPE_H_
#define _RTL8710C_I2C_TYPE_H_

#ifdef  __cplusplus
extern "C"
{
#endif

/// @cond DOXYGEN_GENERAL_REG_TYPE || DOXYGEN_I2C_REG_TYPE

/**
 * @addtogroup hs_hal_i2c_reg I2C Registers.
 * @ingroup hs_hal_i2c
 * @{
 */

/**
  \brief Union type to access i2c_con (@ 0x00000000).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000000) I2C Control Register                                       */
  
  struct {
    __IOM uint32_t mst_mod    : 1;            /*!< [0..0] This bit controls whether the I2C Module master is enabled.        */
    __IOM uint32_t spd        : 2;            /*!< [2..1] These bits control at which speed the I2C Module operates.         */
    __IOM uint32_t slv_10bit_addr : 1;        /*!< [3..3] When acting as a slave, this bit controls whether the
                                                   I2C Module responds to 7- or 10-bit addresses.                            */
    __IOM uint32_t mst_10bit_addr : 1;        /*!< [4..4] This bit controls whether the I2C Module starts its transfers
                                                   in 7- or 10-bit addressing mode when acting as a master.                  */
    __IOM uint32_t rstrt_en   : 1;            /*!< [5..5] This bit determines whether RESTART conditions may be
                                                   sent when acting as a master.                                             */
    __IOM uint32_t slv_dis    : 1;            /*!< [6..6] This bit controls whether I2C has its slave 0 disabled.            */
    __IOM uint32_t slv_dis_1  : 1;            /*!< [7..7] This bit controls whether I2C has its slave 1 disabled.            */
  } b;                                        /*!< bit fields for i2c_con */
} i2c_con_t, *pi2c_con_t;

/**
  \brief Union type to access i2c_tar (@ 0x00000004).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000004) I2C Target Address Register                                */
  
  struct {
    __IOM uint32_t tar        : 10;           /*!< [9..0] This is the target address for any master transaction.             */
    __IOM uint32_t gc_start_byte : 1;         /*!< [10..10] If bit 11 (SPECIAL) is set to 1, then this bit indicates
                                                   whether a General Call or START byte command is to be performed
                                                   by the I2C Module. 0: General Call 1: START BYTE                          */
    __IOM uint32_t spec       : 1;            /*!< [11..11] This bit indicates whether software performs a General
                                                   Call or START BYTE command.                                               */
    __IOM uint32_t tar_10bit_addr : 1;        /*!< [12..12] This bit controls whether the I2C Module starts its
                                                   transfers in 7-or 10-bit addressing mode when acting as
                                                   a master.                                                                 */
  } b;                                        /*!< bit fields for i2c_tar */
} i2c_tar_t, *pi2c_tar_t;

/**
  \brief Union type to access i2c_sar (@ 0x00000008).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000008) I2C Slave Address Register                                 */
  
  struct {
    __IOM uint32_t sar        : 10;           /*!< [9..0] The sar holds the slave address when the I2C is operating
                                                   as a slave.                                                               */
  } b;                                        /*!< bit fields for i2c_sar */
} i2c_sar_t, *pi2c_sar_t;

/**
  \brief Union type to access i2c_hs_maddr (@ 0x0000000C).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x0000000C) I2C High Speed Master Code Address Register                */
  
  struct {
    __IOM uint32_t hs_maddr   : 3;            /*!< [2..0] This bit field holds the value of the I2C HS mode master
                                                   code                                                                      */
  } b;                                        /*!< bit fields for i2c_hs_maddr */
} i2c_hs_maddr_t, *pi2c_hs_maddr_t;

/**
  \brief Union type to access i2c_dat_cmd (@ 0x00000010).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000010) I2C Data Buffer and Command Register                       */
  
  struct {
    __IOM uint32_t dat        : 8;            /*!< [7..0] This register contains the data to be transmitted or
                                                   received on the I2C bus.                                                  */
    __OM  uint32_t cmd        : 1;            /*!< [8..8] This bit controls whether a read or a write is performed.          */
    __OM  uint32_t stp        : 1;            /*!< [9..9] This bit controls whether a STOP is issued after the
                                                   byte is sent or received.                                                 */
    __OM  uint32_t rstrt      : 1;            /*!< [10..10] This bit controls whether a RESTART is issued before
                                                   the byte is sent or received.                                             */
    __OM  uint32_t null_dat   : 1;            /*!< [11..11] This bit controls whether to transfer slave address
                                                   only.                                                                     */
  } b;                                        /*!< bit fields for i2c_dat_cmd */
} i2c_dat_cmd_t, *pi2c_dat_cmd_t;

/**
  \brief Union type to access i2c_ss_scl_hcnt (@ 0x00000014).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000014) Standard Speed I2C Clock SCL High Count Register           */
  
