apache/nuttx/arch/arm/src/rtl8720c/8710c/fwlib/include/rtl8710c_i2c_type.h
  struct {
    __IM  uint32_t clr_stp_det : 1;           /*!< [0..0] Read this register to clear the stop_det interrupt (bit
                                                   9) of the raw_intr_stat register.                                         */
  } b;                                        /*!< bit fields for i2c_clr_stp_det */
} i2c_clr_stp_det_t, *pi2c_clr_stp_det_t;

/**
  \brief Union type to access i2c_clr_strt_det (@ 0x00000064).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000064) Clear START_DET Interrupt Register                         */
  
  struct {
    __IM  uint32_t clr_strt_det : 1;          /*!< [0..0] Read this register to clear the start_det interrupt (bit
                                                   10) of the raw_intr_stat register.                                        */
  } b;                                        /*!< bit fields for i2c_clr_strt_det */
} i2c_clr_strt_det_t, *pi2c_clr_strt_det_t;

/**
  \brief Union type to access i2c_clr_gen_call (@ 0x00000068).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000068) Clear GEN_CALL Interrupt Register                          */
  
  struct {
    __IM  uint32_t clr_gen_call : 1;          /*!< [0..0] Read this register to clear the gen_call interrupt (bit
                                                   11) of raw_intr_stat register                                             */
  } b;                                        /*!< bit fields for i2c_clr_gen_call */
} i2c_clr_gen_call_t, *pi2c_clr_gen_call_t;

/**
  \brief Union type to access i2c_enable (@ 0x0000006C).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x0000006C) I2C Enable Register                                        */
  
  struct {
    __IOM uint32_t en         : 1;            /*!< [0..0] Controls whether the I2C Module is enabled.                        */
    __IOM uint32_t abrt       : 1;            /*!< [1..1] Abort I2C current transfer is done w/o flush Tx/Rx FIFO            */
  } b;                                        /*!< bit fields for i2c_enable */
} i2c_enable_t, *pi2c_enable_t;

/**
  \brief Union type to access i2c_sts (@ 0x00000070).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000070) I2C Status Reigster                                        */
  
  struct {
    __IM  uint32_t act        : 1;            /*!< [0..0] I2C Activity Status.                                               */
    __IM  uint32_t tfnf       : 1;            /*!< [1..1] Transmit FIFO Not Full. Set when the transmit FIFO contains
                                                   one or more empty locations, and is cleared when the FIFO
                                                   is full.                                                                  */
    __IM  uint32_t tfe        : 1;            /*!< [2..2] Transmit FIFO Completely Empty. When the transmit FIFO
                                                   is completely empty, this bit is set. When it contains
                                                   one or morevalid entries, this bit is cleared. This bit
                                                   field does not request an interrupt.                                      */
    __IM  uint32_t rfne       : 1;            /*!< [3..3] Receive FIFO Not Empty. This bit is set when the receive
                                                   FIFO contains one or more entries; it is cleared when the
                                                   receive FIFO is empty.                                                    */
    __IM  uint32_t rff        : 1;            /*!< [4..4] Receive FIFO CompletelyFull. When the receive FIFO iscompletely
                                                   full, this bit is set. When the receive FIFO contains one
                                                   or more empty location, this bit is cleared.                              */
    __IM  uint32_t mst_act    : 1;            /*!< [5..5] Master FSM Activity Status                                         */
    __IM  uint32_t slv_act    : 1;            /*!< [6..6] Slave FSM Activity Status                                          */
    __IM  uint32_t mst_hold_tx_empty : 1;     /*!< [7..7] I2C module is holding I2C bus low (clock stretch) because
                                                   of TX FIFO empty in master mode.                                          */
    __IM  uint32_t mst_hold_rx_full : 1;      /*!< [8..8] I2C module is holding I2C bus low (clock stretch) because
                                                   of RX FIFO full in master mode.                                           */
    __IM  uint32_t slv_hold_tx_empty : 1;     /*!< [9..9] I2C module is holding I2C bus low (clock stretch) because
                                                   of TX FIFO empty in slave mode.                                           */
    __IM  uint32_t slv_hold_rx_full : 1;      /*!< [10..10] I2C module is holding I2C bus low (clock stretch) because
                                                   of RX FIFO full in slave mode.                                            */
    __IOM uint32_t bus_sts    : 2;            /*!< [12..11] Show current I2C bus status                                      */
  } b;                                        /*!< bit fields for i2c_sts */
} i2c_sts_t, *pi2c_sts_t;

/**
  \brief Union type to access i2c_txflr (@ 0x00000074).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000074) I2C Transmit FIFO Level Register                           */
  
  struct {
    __IM  uint32_t txflr      : 5;            /*!< [4..0] Transmit FIFO Level. Contains the number of valid data
                                                   entries in the transmit FIFO.                                             */
  } b;                                        /*!< bit fields for i2c_txflr */
} i2c_txflr_t, *pi2c_txflr_t;

/**
  \brief Union type to access i2c_rxflr (@ 0x00000078).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000078) I2C Receive FIFO Level Register                            */
  
