apache/nuttx/arch/arm/src/rtl8720c/8710c/fwlib/include/rtl8710c_i2c_type.h
  struct {
    __IM  uint32_t rxflr      : 5;            /*!< [4..0] Receive FIFO Level. Contains the number of valid data
                                                   entries in the receive FIFO.                                              */
  } b;                                        /*!< bit fields for i2c_rxflr */
} i2c_rxflr_t, *pi2c_rxflr_t;

/**
  \brief Union type to access i2c_sda_hold (@ 0x0000007C).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x0000007C) I2C SDA Hold Time Length Register                          */
  
  struct {
    __IOM uint32_t sda_hold   : 16;           /*!< [15..0] Sets the required SDA hold timein units of clk period.            */
  } b;                                        /*!< bit fields for i2c_sda_hold */
} i2c_sda_hold_t, *pi2c_sda_hold_t;

/**
  \brief Union type to access i2c_tx_abrt_src (@ 0x00000080).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000080) I2C Transmit Abort Source Register                         */
  
  struct {
    __IM  uint32_t addr_7bit_nack : 1;        /*!< [0..0] 1: Master is in 7-bit addressing mode and the address
                                                   sent was not acknowledged by any slave.                                   */
    __IM  uint32_t addr1_10bit_nack : 1;      /*!< [1..1] 1: Master is in 10-bit address mode and the first 10-bit
                                                   address byte was not acknowledged by any slave.                           */
    __IM  uint32_t addr2_10bit_nack : 1;      /*!< [2..2] 1: Master is in 10-bit address mode and the second address
                                                   byte of the 10-bit address was not acknowledged by any
                                                   slave.                                                                    */
    __IM  uint32_t txdat_nack : 1;            /*!< [3..3] 1: This is a master-mode only bit. Master has received
                                                   an acknowledgement for the address, but when it sent data
                                                   byte(s) following the address, it did not receive an acknowledge
                                                   from the remote slave(s).                                                 */
    __IM  uint32_t gcall_nack : 1;            /*!< [4..4] 1: I2C Module in master mode sent a General Call and
                                                   no slave on the bus acknowledged the General Call.                        */
    __IM  uint32_t gcall_rd   : 1;            /*!< [5..5] 1: I2C Module in master mode sent a General Call but
                                                   the user programmed the byte following the General Call
                                                   to be a read from the bus (dat_cmd[9] is set to 1).                       */
    __IM  uint32_t hs_ackdet  : 1;            /*!< [6..6] 1: Master is in High Speed mode and the High Speed Master
                                                   code was acknowledged (wrong behavior).                                   */
    __IM  uint32_t sbyte_ackdet : 1;          /*!< [7..7] 1: Master has sent a START Byte and the START Byte was
                                                   acknowledged (wrong behavior).                                            */
    __IM  uint32_t norstrt_hs : 1;            /*!< [8..8] 1: The restart is disabled (rstrt_en bit (con[5]) = 0)
                                                   and the user is trying to use the master to transfer data
                                                   in High Speed mode.                                                       */
    __IM  uint32_t norstrt_sbyte : 1;         /*!< [9..9] 1: The restart is disabled (rstrt bit con[5]) = 0) and
                                                   the user is trying to send a START Byte.                                  */
    __IM  uint32_t norstrt_10bit_rd : 1;      /*!< [10..10] 1: The restart is disabled (rstrt_en bit (con[5]) =
                                                   0) and the master sends a read command in 10-bit addressing
                                                   mode.                                                                     */
    __IM  uint32_t mst_dis    : 1;            /*!< [11..11] 1: User tries to initiate a Master operation with the
                                                   Master mode disabled.                                                     */
    __IM  uint32_t arb_lost   : 1;            /*!< [12..12] 1: Master has lost arbitration, or if tx_abrt_src[14]
                                                   is also set, then the slave transmitter has lost arbitration.             */
    __IM  uint32_t slvflush_txfifo : 1;       /*!< [13..13] 1: Slave has received a read command and some data
                                                   exists in the TX FIFO so the slave issues a tx_abrt interrupt
                                                   to flush old data in TX FIFO.                                             */
    __IM  uint32_t slv_arblost : 1;           /*!< [14..14] 1: Slave lost the bus while transmitting data to a
                                                   remote master. Tx_abrt_src[12] is set at the same time.                   */
    __IM  uint32_t slvrd_intx : 1;            /*!< [15..15] 1: When the processor side responds to a slave mode
                                                   request for data to be transmitted to a remote master and
                                                   user writes a 1 in cmd(bit 8) of dat_cmd register.                        */
  } b;                                        /*!< bit fields for i2c_tx_abrt_src */
} i2c_tx_abrt_src_t, *pi2c_tx_abrt_src_t;

/**
  \brief Union type to access i2c_slv_dat_nack (@ 0x00000084).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000084) I2C Generate Slave Data NACK Register                      */
  
