apache/nuttx/arch/arm/src/rtl8720c/8710c/fwlib/include/rtl8710c_i2c_type.h
  struct {
    __IOM uint32_t slv_dat_nack : 1;          /*!< [0..0] Generate NACK. This NACK generation only occurs when
                                                   I2C Module is a slavereceiver. If this register is set
                                                   to a value of 1, it can only generate a NACK after a data
                                                   byte is received; hence, the data transfer is aborted and
                                                   the data received is not pushed to the receive buffer.
                                                   When the register is set to a value of 0, it generates
                                                   NACK/ACK, depending on normal criteria.                                   */
  } b;                                        /*!< bit fields for i2c_slv_dat_nack */
} i2c_slv_dat_nack_t, *pi2c_slv_dat_nack_t;

/**
  \brief Union type to access i2c_dma_cr (@ 0x00000088).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000088) I2C DMA Control Reigster                                   */
  
  struct {
    __IOM uint32_t rdmae      : 1;            /*!< [0..0] Receive DMA Enable. This bit enables/disables the receive
                                                   FIFO DMA channel.                                                         */
    __IOM uint32_t tdmae      : 1;            /*!< [1..1] Transmit DMA Enable. This bit enables/disables the transmit
                                                   FIFO DMA channel.                                                         */
  } b;                                        /*!< bit fields for i2c_dma_cr */
} i2c_dma_cr_t, *pi2c_dma_cr_t;

/**
  \brief Union type to access i2c_dma_tdlr (@ 0x0000008C).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x0000008C) I2C DMA Transmit Data Level Register                       */
  
  struct {
    __IOM uint32_t tdlr       : 4;            /*!< [3..0] Transmit Data Level. This bit field controls the level
                                                   at which a DMA request is made by the transmit logic. It
                                                   is equal to the watermark level; that is, the dma_tx_req
                                                   signal is generated when the number of valid data entries
                                                   in the transmit FIFO is equal to or below this field value,
                                                   and tdmae= 1.                                                             */
  } b;                                        /*!< bit fields for i2c_dma_tdlr */
} i2c_dma_tdlr_t, *pi2c_dma_tdlr_t;

/**
  \brief Union type to access i2c_dma_rdlr (@ 0x00000090).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000090) I2C DMA Receive Data Level Register                        */
  
  struct {
    __IOM uint32_t rdlr       : 4;            /*!< [3..0] Receive Data Level.                                                */
  } b;                                        /*!< bit fields for i2c_dma_rdlr */
} i2c_dma_rdlr_t, *pi2c_dma_rdlr_t;

/**
  \brief Union type to access i2c_sda_setup (@ 0x00000094).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000094) I2C SDA Setup Register                                     */
  
  struct {
    __IOM uint32_t sda_setup  : 8;            /*!< [7..0] SDA Setup. It is recommended that if the required delay
                                                   is 1000ns, then for an clk frequency of 10 MHz, sda_setup
                                                   should be programmed to a value of 11. sda_setup must be
                                                   programmed with a minimum value of 2.                                     */
  } b;                                        /*!< bit fields for i2c_sda_setup */
} i2c_sda_setup_t, *pi2c_sda_setup_t;

/**
  \brief Union type to access i2c_ack_gen_call (@ 0x00000098).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000098) I2C ACK General Call Register                              */
  
  struct {
    __IOM uint32_t ack_gen_call : 1;          /*!< [0..0] ACK General Call. When set to 1, I2C Module responds
                                                   with a ACK (by asserting data_oe) when it receives a General
                                                   Call. When set to 0, the I2C Module does not generate General
                                                   Call interrupts.                                                          */
  } b;                                        /*!< bit fields for i2c_ack_gen_call */
} i2c_ack_gen_call_t, *pi2c_ack_gen_call_t;

/**
  \brief Union type to access i2c_en_sts (@ 0x0000009C).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x0000009C) I2C Enable Status Register                                 */
  
  struct {
    __IM  uint32_t en         : 1;            /*!< [0..0] Enable Status.                                                     */
    __IM  uint32_t slv_dis_in_busy : 1;       /*!< [1..1] Slave Disabled While Busy (Transmit, Receive). This bit
                                                   indicates if a potential or active Slave operation has
                                                   been aborted due to the setting of the ENABLE register
                                                   from 1 to 0.                                                              */
    __IM  uint32_t slv_rx_dat_lost : 1;       /*!< [2..2] Slave Received Data Lost. This bit indicates if a Slave-Receiver
                                                   operation has been aborted with at least one data byte
                                                   received from an I2C transfer due to the setting of enable
                                                   from 1 to 0.                                                              */
    __IM  uint32_t dma_dis_sts : 2;           /*!< [4..3] DMA_DISABLE_WHILE_BUSY. 00: No ill disable event is active
                                                   01: I2C is disable while busy in legacy mode 10: I2C is
                                                   disable while busy in DMA mode 11: I2C is disable while
                                                   busy in Descriptor mode                                                   */
  } b;                                        /*!< bit fields for i2c_en_sts */
} i2c_en_sts_t, *pi2c_en_sts_t;

/**
  \brief Union type to access i2c_dma_cmd (@ 0x000000A0).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x000000A0) I2C DMA Command Register                                   */
  
