apache/nuttx/arch/arm/src/rtl8720c/8710c/fwlib/include/rtl8710c_i2c_type.h
  struct {
    __IOM uint32_t en         : 1;            /*!< [0..0] Set to enable DMA mode.                                            */
    __IM  uint32_t            : 4;
    __IOM uint32_t cmd        : 1;            /*!< [5..5] This bit controls whether a read or a write is performed.
                                                   This bit does not control the direction when the I2C Module
                                                   acts as a slave. It controls only the direction when it
                                                   acts as a master. 1 = Read 0 = Write                                      */
    __IOM uint32_t stp        : 1;            /*!< [6..6] This bit controls whether a STOP is issued after the
                                                   byte is sent or received.                                                 */
    __IOM uint32_t rstrt      : 1;            /*!< [7..7] This bit controls whether a RESTART is issued before
                                                   the byte is sent or received when DMA mode is enabled.                    */
  } b;                                        /*!< bit fields for i2c_dma_cmd */
} i2c_dma_cmd_t, *pi2c_dma_cmd_t;

/**
  \brief Union type to access i2c_dma_len (@ 0x000000A4).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x000000A4) I2C DMA Transfer Data Length Register                      */
  
  struct {
    __IOM uint32_t len        : 16;           /*!< [15..0] DMA transfer data length(R/W)                                     */
    __IM  uint32_t tr_len     : 16;           /*!< [31..16] DMA mode transfer bytes(Read only)                               */
  } b;                                        /*!< bit fields for i2c_dma_len */
} i2c_dma_len_t, *pi2c_dma_len_t;

/**
  \brief Union type to access i2c_dma_mod (@ 0x000000A8).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x000000A8) I2C DMA Mode Register                                      */
  
  struct {
    __IOM uint32_t dma_mod    : 2;            /*!< [1..0] DMA operation mode                                                 */
  } b;                                        /*!< bit fields for i2c_dma_mod */
} i2c_dma_mod_t, *pi2c_dma_mod_t;

/**
  \brief Union type to access i2c_slp (@ 0x000000AC).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x000000AC) I2C Sleep Control Register                                 */
  
  struct {
    __IOM uint32_t clk_ctrl   : 1;            /*!< [0..0] I2C clock control, write 1 controller would gate I2C
                                                   clock until I2C slave is enable and reset synchronized
                                                   register procedure is done                                                */
    __IM  uint32_t slp_clk_gated : 1;         /*!< [1..1] I2C clock has been gated (Read Only)                               */
  } b;                                        /*!< bit fields for i2c_slp */
} i2c_slp_t, *pi2c_slp_t;

/**
  \brief Union type to access i2c_dat_fltr_rsts_l (@ 0x000000B8).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x000000B8) Data Filter Resistor Low Register                          */
  
  struct {
    __IOM uint32_t dat_fltr_rsts_l : 20;      /*!< [19..0] Data Filter Resistor Low                                          */
  } b;                                        /*!< bit fields for i2c_dat_fltr_rsts_l */
} i2c_dat_fltr_rsts_l_t, *pi2c_dat_fltr_rsts_l_t;

/**
  \brief Union type to access i2c_dat_fltr_rsts_m (@ 0x000000BC).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x000000BC) Data Filter Resistor Main Register                         */
  
  struct {
    __IOM uint32_t dat_fltr_rsts_m : 20;      /*!< [19..0] Data Filter Resistor Main                                         */
  } b;                                        /*!< bit fields for i2c_dat_fltr_rsts_m */
} i2c_dat_fltr_rsts_m_t, *pi2c_dat_fltr_rsts_m_t;

/**
  \brief Union type to access i2c_clk_fltr_rsts_l (@ 0x000000C0).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x000000C0) Clock Filter Resistor Low Register                         */
  
  struct {
    __IOM uint32_t clk_fltr_rsts_l : 20;      /*!< [19..0] Clock Filter Resistor Low                                         */
  } b;                                        /*!< bit fields for i2c_clk_fltr_rsts_l */
} i2c_clk_fltr_rsts_l_t, *pi2c_clk_fltr_rsts_l_t;

/**
  \brief Union type to access i2c_clk_fltr_rsts_m (@ 0x000000C4).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x000000C4) Clock Filter Resistor Main Register                        */
  
  struct {
    __IOM uint32_t clk_fltr_rsts_m : 20;      /*!< [19..0] Clock Filter Resistor Main                                        */
  } b;                                        /*!< bit fields for i2c_clk_fltr_rsts_m */
} i2c_clk_fltr_rsts_m_t, *pi2c_clk_fltr_rsts_m_t;

/**
  \brief Union type to access i2c_dat_fltr_cap_l (@ 0x000000C8).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x000000C8) Data Filter Capacitor Low Register                         */
  
  struct {
    __IOM uint32_t dat_fltr_cap_l : 20;       /*!< [19..0] Data Filter Capacitor Low                                         */
  } b;                                        /*!< bit fields for i2c_dat_fltr_cap_l */
} i2c_dat_fltr_cap_l_t, *pi2c_dat_fltr_cap_l_t;

/**
  \brief Union type to access i2c_dat_fltr_cap_m (@ 0x000000CC).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x000000CC) Data Filter Capacitor Main Register                        */
  
  struct {
    __IOM uint32_t dat_fltr_cap_m : 5;        /*!< [4..0] Data Filter Capacitor Main                                         */
  } b;                                        /*!< bit fields for i2c_dat_fltr_cap_m */
} i2c_dat_fltr_cap_m_t, *pi2c_dat_fltr_cap_m_t;

/**
  \brief Union type to access i2c_clk_fltr_cap_l (@ 0x000000D0).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x000000D0) Clock Filter Capacitor Low Register                        */
  
