apache/nuttx/arch/arm/src/rtl8720c/8710c/fwlib/include/rtl8710c_i2c_type.h
  struct {
    __IOM uint32_t clk_fltr_cap_l : 20;       /*!< [19..0] Clock Filter Capacitor Low                                        */
  } b;                                        /*!< bit fields for i2c_clk_fltr_cap_l */
} i2c_clk_fltr_cap_l_t, *pi2c_clk_fltr_cap_l_t;

/**
  \brief Union type to access i2c_clk_fltr_cap_m (@ 0x000000D4).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x000000D4) Clock Filter Capacitor Main Register                       */
  
  struct {
    __IOM uint32_t clk_fltr_cap_m : 5;        /*!< [4..0] Clock Filter Capacitor Main                                        */
  } b;                                        /*!< bit fields for i2c_clk_fltr_cap_m */
} i2c_clk_fltr_cap_m_t, *pi2c_clk_fltr_cap_m_t;

/**
  \brief Union type to access i2c_clr_addr_match (@ 0x000000E4).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x000000E4) Clear I2C ADDR_MATCH Interrupt Register                    */
  
  struct {
    __IOM uint32_t clr_addr_match : 1;        /*!< [0..0] Clear address match interrupts raw status, and it's read
                                                   clear.                                                                    */
  } b;                                        /*!< bit fields for i2c_clr_addr_match */
} i2c_clr_addr_match_t, *pi2c_clr_addr_match_t;

/**
  \brief Union type to access i2c_clr_dma_done (@ 0x000000E8).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x000000E8) Clear I2C DMA_DONE Interrupt Register                      */
  
  struct {
    __IOM uint32_t clr_dma_done : 1;          /*!< [0..0] Clear dma_i2c_done_intr interrupts raw status, and it's
                                                   read clear.                                                               */
  } b;                                        /*!< bit fields for i2c_clr_dma_done */
} i2c_clr_dma_done_t, *pi2c_clr_dma_done_t;

/**
  \brief Union type to access i2c_fltr (@ 0x000000EC).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x000000EC) I2C Bus Filter Register                                    */
  
  struct {
    __IOM uint32_t dig_fltr_deg : 4;          /*!< [3..0] I2C module digital filter degree                                   */
    __IM  uint32_t            : 4;
    __IOM uint32_t dig_fltr_en : 1;           /*!< [8..8] I2C module digital filter slection (enable)                        */
  } b;                                        /*!< bit fields for i2c_fltr */
} i2c_fltr_t, *pi2c_fltr_t;

/**
  \brief Union type to access i2c_sar1 (@ 0x000000F4).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x000000F4) I2C Slave Address 1 Register                               */
  
  struct {
    __IOM uint32_t sar1       : 7;            /*!< [6..0] I2C Second Slave Address                                           */
  } b;                                        /*!< bit fields for i2c_sar1 */
} i2c_sar1_t, *pi2c_sar1_t;

/**
  \brief Union type to access i2c_ver (@ 0x000000FC).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x000000FC) I2C Component Version Register                             */
  
  struct {
    __IM  uint32_t ver        : 32;           /*!< [31..0] I2C module version number                                         */
  } b;                                        /*!< bit fields for i2c_ver */
} i2c_ver_t, *pi2c_ver_t;

/** @} */ /* End of group ls_hal_i2c_reg */
/// @endcond /* End of condition DOXYGEN_GENERAL_REG_TYPE || DOXYGEN_I2C_REG_TYPE */


#ifdef  __cplusplus
}
#endif

#endif    // end of #ifndef _RTL8710C_I2C_TYPE_H_

